print('Hello, world')

"""
Hello, world
Написать программу, которая выводит в точности строку "Hello, world"

Examples
    
    Input
        test
    Output
        Hello, World
"""